0x01-challenge/blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."online" = ? ORDER BY created_at DESC  [["online", true]]
---
  def index
    @posts = Post.where(online: true).order('created_at DESC')

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "online" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["online", false], ["updated_at", 2019-09-27 02:21:42 UTC], ["id", 2]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body, :online))